[
  {
    "id": 1,
    "techcat": {
      "name": "Miss Peregrine",
      "bio": "Queen of the household, Miss Peregrine commands respect with her elegant tuxedo coat and dignified demeanor. While she may appear standoffish at first glance, this senior feline harbors a heart of gold beneath her formal exterior. Her regal presence is so powerful that even the border collie knows better than to challenge her authority. When not supervising her domain from carefully selected perches, Ms Peregrine might grace a lucky human with her rare but meaningful displays of affection. A true tech companion who appreciates order and precision, she silently judges code quality from a distance while maintaining her aristocratic composure.",
      "in_memoriam": false,
      "photo": {
        "alt": "A black and white cat mid-yawn, showing sharp teeth and tongue. Whiskers fan out, and the background shows a bed, dresser, and open door.",
        "height": 450,
        "src": "/assets/cats/kitty.webp",
        "width": 450
      }
    },
    "caretaker": {
      "name": "Schalk Neethling",
      "urls": {
        "website": "https://schalkneethling.com",
        "social": "https://hachyderm.io/@schalkneethling",
        "github": "https://github.com/schalkneethling"
      }
    }
  },
  {
    "id": 2,
    "techcat": {
      "name": "Salem",
      "bio": "Salem, Miss Peregrine's distinguished offspring, carries himself with the quiet elegance befitting his lineage. His snowshoe coat and mesmerizing blue eyes make him a vision of feline beauty, drawing admiring glances but rarely seeking attention. This reserved gentleman saves his rare but treasured purrs for special occasions, turning each rumble into a memorable event worth celebrating. While he generally keeps to himself, Salem has formed an unbreakable bond with our youngest daughter, his chosen human. Nothing brings him more joy than a small bowl of milk, which he savors with delicate appreciation. Though not one for the spotlight, this soft, cuddly sweetheart brings a gentle presence to the household tech scene, offering silent companionship to our daughter as she navigates the digital world.",
      "in_memoriam": false,
      "photo": {
        "alt": "A cat with a white face and dark markings lies on a pink blanket, gazing sleepily. The background shows a cozy room with curtains, shelves, and decor.",
        "height": 450,
        "src": "/assets/cats/salem.webp",
        "width": 450
      }
    },
    "caretaker": {
      "name": "Schalk Neethling",
      "urls": {
        "website": "https://schalkneethling.com",
        "social": "https://hachyderm.io/@schalkneethling",
        "github": "https://github.com/schalkneethling"
      }
    }
  },
  {
    "id": 3,
    "techcat": {
      "name": "Samurai",
      "bio": "Samurai, the fiery ginger warrior, joined the household with a legendary origin story—having faced down two Huskies before her rescue by neighborly heroes. This fearless feline brings vibrant energy to our home, with a mischievous spirit that finds particular joy in stalking Miss Peregrine through windows, much to the elder cat's dismay. Despite her fierce reputation, Samurai melts at the promise of a good scratch, frequently interrupting coding sessions by leaping onto my desk to demand immediate attention and cuddles. Her sudden keyboard inspections might seem like affection, but perhaps she's actually conducting rigorous code reviews, her amber eyes scanning for bugs with the same intensity she once faced down those canine adversaries. Equal parts tenacious fighter and loving companion, Samurai proves daily that the smallest packages often contain the boldest spirits.",
      "in_memoriam": false,
      "photo": {
        "alt": "A ginger cat with bright amber eyes lounges comfortably in a woven basket bed lined with soft blankets. The cat has a calm, alert expression and is resting with its paws tucked under its body. ",
        "height": 450,
        "src": "/assets/cats/samurai.webp",
        "width": 450
      }
    },
    "caretaker": {
      "name": "Schalk Neethling",
      "urls": {
        "website": "https://schalkneethling.com",
        "social": "https://hachyderm.io/@schalkneethling",
        "github": "https://github.com/schalkneethling"
      }
    }
  },
  {
    "id": 4,
    "techcat": {
      "name": "Alfi",
      "bio": "Alfi is a ginger Persian cat and the undisputed king of our small household. He was born a year before the pandemic and came to us as a 3 month old kitten. That's probably why he became very attached to his human subjects. When he's not taking royal naps, often in most peculiar positions, he enjoys exploring his kingdom and playing with almost anything that isn't a cat toy. His favourites include packaging material, zip ties, and cables.",
      "in_memoriam": false,
      "photo": {
        "alt": "A ginger cat with bright amber eyes lies comfortably on top of the pillows of a sofa. The cat looks sleepy and is resting with its paws tucked under its body and on the backside of the sofa. ",
        "height": 450,
        "src": "/assets/cats/alfi.jpg",
        "width": 450
      }
    },
    "caretaker": {
      "name": "Tom",
      "urls": {
        "website": "https://ttntm.me",
        "social": "https://fosstodon.org/@ttntm",
        "github": "https://github.com/ttntm"
      }
    }
  },
  {
    "id": 5,
    "techcat": {
      "name": "Poocha",
      "bio": "Poocha (പൂച്ച in Malaylam), was not your typical cuddly cat — he made it very clear that affection was on his terms only. Any attempt at snuggles was met with a swift and merciless scratch, a reminder that love must be earned, not forced. A true master of relaxation, he spent most of his days napping in the warmest spots he could find, only taking breaks to bring us the occasional “gift” in the form of an unfortunate mouse. With his signature don't care attitude, he ruled the house with quiet authority, never once bothering to impress anyone—but somehow managing to steal our hearts anyway. Rest well, Poocha. May there be endless naps and no unwanted cuddles wherever you are.",
      "in_memoriam": true,
      "photo": {
        "alt": "A ginger cat sleeps peacefully, curled up with its eyes closed and paws tucked in, resting on a floral-patterned fabric.",
        "height": 450,
        "src": "/assets/cats/poocha.webp",
        "width": 450
      }
    },
    "caretaker": {
      "name": "D34dMan",
      "urls": {
        "website": "https://www.d34dman.com",
        "github": "https://github.com/d34dman"
      }
    }
  },
  {
    "id": 6,
    "techcat": {
      "name": "Bandit (2018-2021)",
      "bio": "A big gentle cat who didn't bite if you annoyed him (he'd just put his teeth on your hand to let you know he could if he wanted to), was the only cat I knew who didn't meow (just chirped), knew how fidget spinners work, kind of understood the concept of mirrors (probably didn't recognize himself, like some primates/dolphins/elephants do, but knew some things in the mirror are actually happening behind him), was incredibly loving and affectionate, and an impressively high jumper for his size which he used to show off whenever I'd stick a red suction cup on the wall (just one of his many party tricks). Bandy helped me get through some very dark times and was by my side every single day for the first year and a half of the Covid pandemic. He lived with us for 1174 days.",
      "in_memoriam": true,
      "photo": {
        "alt": "A grey and white cat sits next to a tablet with a keyboard, staring at code on the screen. The code has colorful syntax highlighting.",
        "height": 450,
        "src": "/assets/cats/bandit.webp",
        "width": 450
      }
    },
    "caretaker": {
      "name": "Stefan Matei",
      "urls": {
        "social": "https://bsky.app/profile/stefanmatei.com",
        "github": "https://github.com/nonsalant/"
      }
    }
  },
  {
    "id": 7,
    "techcat": {
      "name": "Baxter",
      "bio": "my companion through thick and thin. a kind boy who loves me very much. favorite hobbies include boxes, napping, and pets. big fan of being brushed as well.",
      "in_memoriam": false,
      "photo": {
        "alt": "A close-up of a grey tabby cat with greenish-yellow eyes, gazing intently. Its ears are perked up, and its whiskers are prominent.",
        "height": 450,
        "src": "/assets/cats/baxter.webp",
        "width": 450
      }
    },
    "caretaker": {
      "name": "emma",
      "urls": {
        "website": "https://emmas.place"
      }
    }
  },
  {
    "id": 8,
    "techcat": {
      "name": "Nanina (2010-2025)",
      "bio": "Nanina was a retired princess warrior, that spread her magic anywhere she went and who chose to spend her last years in the peace of her house in the countryside of Portugal, leaving behind her many years of terrorising unsuspecting legs. She had befriended chickens, sheep and ants, but hated other cats and baths. The love of her life had been her brother Aquiles, a pit bull that thought he was a cat. She was a very work-oriented cat, dividing her days between her various hour long naps, and protecting us and the house with her multiple outdoor patrols. She was a renowned snorer, and could sense any hand approaching her, always releasing her signature sound (a turtledove-like sound with a “hmm!!”) that would let them know that she was always on watch, always on high alert! Awake she was a lady warrior on a mission, always with a not amused expression; asleep she would always gift us with her smiley face. She ruled the house and our hearts, sneakily manipulating everyone with her cuteness into giving her more food and snacks. She was a great assistant and cheerleader, providing us background snores from her beanbag, while we were working on our computers.",
      "in_memoriam": true,
      "photo": {
        "alt": "A ginger tabby cat lounges on a textured rug, bathed in sunlight. Its green eyes gaze off to the side, with a green potted plant in the background.",
        "height": 450,
        "src": "/assets/cats/nanina.webp",
        "width": 450
      }
    },
    "caretaker": {
      "name": "Joana, Christian (and part-time Tiago)",
      "urls": {
        "social": "https://bsky.app/profile/hejchristian.com",
        "website": "https://www.hejchristian.com/"
      }
    }
  },
  {
    "id": 9,
    "techcat": {
      "name": "Tommi Girl",
      "bio": "Tommi Girl is a proud Nebelung, a pedigree breed known for their long, luxurious coats, emerald-green eyes, and graceful presence. With her serene temperament and an eye for clean code, Tommi has taken her rightful place as Graceful Web Studio’s Chief Purrformance Officer. When she’s not lounging regally on the mouse pad (yes, that mouse pad—with your project on screen), she’s lending a paw in Webflow builds, inspecting semantic HTML, and advocating for digital inclusion. Tommi believes that every corner of the World Wide Web should be paw-sitively accessible to all. Her favorite things include: 🖱️ Sitting directly on your mouse when you're trying to work, 🌞 Long catnaps in sun-drenched windows, 💻 Purring loudly during client calls, 🐈 Declaring \"all websites need more alt text—and tuna!\". She’s not just a tech cat, she’s a meowdel of inclusive design.",
      "in_memoriam": false,
      "photo": {
        "alt": "A fluffy gray cat sits on a pink polka-dot mouse pad in front of a computer monitor displaying a chat conversation.",
        "height": 450,
        "src": "/assets/cats/tommi-girl.webp",
        "width": 450
      }
    },
    "caretaker": {
      "name": "Crystal Scott, CPWA",
      "urls": {
        "social": "https://www.linkedin.com/in/crystal-scott-cpwa-3b1875199/",
        "website": "https://www.gracefulwebstudio.com/"
      }
    }
  }
]
